petersdw1/Battlab-One/MSP430.Firmware_Production_Rev_1.01.c
//******************************************************************************
//   MSP430G2xx3 based BattLab1_Pre-Release
//
//   Doug Peters
//   Bluebird Labs LLC.
//   www.bluebird.com
//   February 2019
//   Built with CCS V7.0
//******************************************************************************

#include <msp430.h>
#include <stdint.h>
#include <stdbool.h>

//******************************************************************************
// #Defines ************************************************************
//******************************************************************************
//i2c Addresses
#define INA233_ADDR  0x40  //INA233
#define AD5248_ADDR  0x2c  //AD5248

#define R1_ADDR  0x80  //RDAC Resistor1 Register Addresses
#define R2_ADDR  0x00  //RDAC Resistor2 Register Addresses

//UART
#define TXD BIT2
#define RXD BIT1
#define LF 10
#define CR 13
#define MAX_BUFFER_SIZE     20

volatile char d[5];

//******************************************************************************
//INA233 Data **********************************************
//******************************************************************************
uint8_t INA233_4_D0 [2] = { 0x15,0x43 }; ///set parameters for INA233 D0h register MFR_ADC_CONFIG
uint8_t INA233_16_D0 [2] = { 0x15,0x45 }; ///set parameters for INA233 D0h register MFR_ADC_CONFIG
uint8_t INA233_64_D0 [2] = { 0x15,0x47 }; ///set parameters for INA233 D0h register MFR_ADC_CONFIG


//uint8_t INA_D4 [2] = { 0x68,0x06 }; ///MFR CAL for active mode
//uint8_t INA1_D4 [2] = { 0x81,0x00 }; ///MFR CAL for sleep mode

uint8_t INA_D4 [2] = { 0x55,0x0D }; ///MFR CAL for active mode
uint8_t INA1_D4 [2] = { 0x00,0x02 }; ///MFR CAL for sleep mode


//******************************************************************************
//AD5248 Digital Potentiometer Data
//******************************************************************************

//Resistor Values for Adj Voltage Regulator
uint8_t SetR2 [1] = { 0x31};

uint8_t SetR1_1_2 [1] = { 0x19}; //1.2V
uint8_t SetR1_1_5 [1] = { 0x2B}; //1.5V
uint8_t SetR1_2_4 [1] = { 0x63}; //2.4V
uint8_t SetR1_3_0 [1] = { 0x89}; //3.0V
uint8_t SetR1_3_2 [1] = { 0x98}; //3.2V
uint8_t SetR1_3_6 [1] = { 0xAB}; //3.6V
uint8_t SetR1_3_7 [1] = { 0xB1}; //3.7V
uint8_t SetR1_4_2 [1] = { 0xD2}; //4.2V
uint8_t SetR1_4_5 [1] = { 0xE4}; //4.5V


//******************************************************************************
//Calibration Factors *********************************************
//******************************************************************************

// Active current resistor calibration
#define VERSION_MSB 0x03;
#define VERSION_LSB 0xE9;

#define CAL_12_MSB 0x01;
#define CAL_12_LSB 0x3B;

#define CAL_15_MSB 0x00;
#define CAL_15_LSB 0xE1;

#define CAL_24_MSB 0x00;
#define CAL_24_LSB 0xB5;

#define CAL_30_MSB 0x00;
#define CAL_30_LSB 0xAE;

#define CAL_32_MSB 0x00;
#define CAL_32_LSB 0xAE;

#define CAL_36_MSB 0x00;
#define CAL_36_LSB 0xAA;

#define CAL_37_MSB 0x00;
#define CAL_37_LSB 0xA8;

#define CAL_42_MSB 0x00;
#define CAL_42_LSB 0xA5;

#define CAL_45_MSB 0x00;
#define CAL_45_LSB 0xA1;

// Sleep current offset factors
#define OFFSET_12_MSB 0x00;
#define OFFSET_12_LSB 0x82;

#define OFFSET_15_MSB 0x00;
#define OFFSET_15_LSB 0xFA;

#define OFFSET_24_MSB 0x01;
#define OFFSET_24_LSB 0x04;

#define OFFSET_30_MSB 0x01;
#define OFFSET_30_LSB 0x18;

#define OFFSET_32_MSB 0x01;
#define OFFSET_32_LSB 0x18;

#define OFFSET_36_MSB 0x03;
#define OFFSET_36_LSB 0x30;

#define OFFSET_37_MSB 0x03;
#define OFFSET_37_LSB 0x34;

#define OFFSET_42_MSB 0x03;
#define OFFSET_42_LSB 0x6B;

#define OFFSET_45_MSB 0x03;
#define OFFSET_45_LSB 0xB6;


//******************************************************************************
//RDAC Data - Values for WriteReg **********************************************
//******************************************************************************
uint8_t Reg_Data [1] = { 0x00};


//******************************************************************************
// General I2C State Machine ***************************************************
//******************************************************************************

typedef enum I2C_ModeEnum{
    IDLE_MODE,
    NACK_MODE,
    TX_REG_ADDRESS_MODE,
    RX_REG_ADDRESS_MODE,
    TX_DATA_MODE,
    RX_DATA_MODE,
    SWITCH_TO_RX_MODE,
    SWITHC_TO_TX_MODE,
    TIMEOUT_MODE
} I2C_Mode;

typedef enum Transmit_ModeEnum{
    IDLE,
    TRANSMIT
} Transmit_Mode;

/* Used to track the state of the software state machine*/
I2C_Mode MasterMode = IDLE_MODE;
Transmit_Mode TXMode = IDLE;

/* The Register Address/Command to use*/
uint8_t TransmitRegAddr = 0;

/* ReceiveBuffer: Buffer used to receive data in the ISR
 * RXByteCtr: Number of bytes left to receive
 * ReceiveIndex: The index of the next byte to be received in ReceiveBuffer
 * TransmitBuffer: Buffer used to transmit data in the ISR
 * TXByteCtr: Number of bytes left to transfer
 * TransmitIndex: The index of the next byte to be transmitted in TransmitBuffer
 * */
volatile uint8_t ReceiveBuffer[MAX_BUFFER_SIZE] = {0};
volatile  uint8_t data[MAX_BUFFER_SIZE] = {0};
uint8_t RXByteCtr = 0;
uint8_t ReceiveIndex = 0;
uint8_t TransmitBuffer[MAX_BUFFER_SIZE] = {0};
uint8_t TXByteCtr = 0;
uint8_t TransmitIndex = 0;

/* I2C Write and Read Functions */

/* For slave device with dev_addr, writes the data specified in *reg_data
 *
 * dev_addr: The slave device address.
 *           Example: SLAVE_ADDR
 * reg_addr: The register or command to send to the slave.
 *           Example: CMD_TYPE_0_MASTER
 * *reg_data: The buffer to write
 *           Example: MasterType0
 * count: The length of *reg_data
 *           Example: TYPE_0_LENGTH
 *  */
I2C_Mode I2C_Master_WriteReg(uint8_t dev_addr, uint8_t reg_addr, uint8_t *reg_data, uint8_t count);

