petersdw1/Battlab-One/MSP430.Firmware_Production_Rev_1.01.c
/* For slave device with dev_addr, read the data specified in slaves reg_addr.
 * The received data is available in ReceiveBuffer
 *
 * dev_addr: The slave device address.
 *           Example: SLAVE_ADDR
 * reg_addr: The register or command to send to the slave.
 *           Example: CMD_TYPE_0_SLAVE
 * count: The length of data to read
 *           Example: TYPE_0_LENGTH
 *  */
I2C_Mode I2C_Master_ReadReg(uint8_t dev_addr, uint8_t reg_addr, uint8_t count);
void CopyArray(volatile uint8_t *source, volatile uint8_t *dest, uint8_t count);

I2C_Mode I2C_Master_ReadReg(uint8_t dev_addr, uint8_t reg_addr, uint8_t count)
{
    /* Initialize state machine */
    MasterMode = TX_REG_ADDRESS_MODE;
    TransmitRegAddr = reg_addr;
    RXByteCtr = count;
    TXByteCtr = 0;
    ReceiveIndex = 0;
    TransmitIndex = 0;

    /* Initialize slave address and interrupts */
    UCB0I2CSA = dev_addr;
    IFG2 &= ~(UCB0TXIFG + UCB0RXIFG);       // Clear any pending interrupts
    IE2 &= ~UCB0RXIE;                       // Disable RX interrupt
    IE2 |= UCB0TXIE;                        // Enable TX interrupt

    UCB0CTL1 |= UCTR + UCTXSTT;             // I2C TX, start condition
    __bis_SR_register(CPUOFF + GIE);              // Enter LPM0 w/ interrupts

    return MasterMode;

}

I2C_Mode I2C_Master_WriteReg(uint8_t dev_addr, uint8_t reg_addr, uint8_t *reg_data, uint8_t count)
{
    /* Initialize state machine */
    MasterMode = TX_REG_ADDRESS_MODE;
    TransmitRegAddr = reg_addr;

    //Copy register data to TransmitBuffer
    CopyArray(reg_data, TransmitBuffer, count);

    TXByteCtr = count;
    RXByteCtr = 0;
    ReceiveIndex = 0;
    TransmitIndex = 0;

    /* Initialize slave address and interrupts */
    UCB0I2CSA = dev_addr;
    IFG2 &= ~(UCB0TXIFG + UCB0RXIFG);       // Clear any pending interrupts
    IE2 &= ~UCB0RXIE;                       // Disable RX interrupt
    IE2 |= UCB0TXIE;                        // Enable TX interrupt

    UCB0CTL1 |= UCTR + UCTXSTT;             // I2C TX, start condition
    __bis_SR_register(CPUOFF + GIE);              // Enter LPM0 w/ interrupts

    return MasterMode;
}

void CopyArray(volatile uint8_t *source, volatile uint8_t *dest, uint8_t count)
{
    uint8_t copyIndex = 0;
    for (copyIndex = 0; copyIndex < count; copyIndex++)
    {
        dest[copyIndex] = source[copyIndex];
    }
}

void uartInit(void);
void bin2bcd(unsigned int v);
void putc(unsigned char c);


//******************************************************************************
// Device Initialization *******************************************************
//******************************************************************************

void initClockTo16MHz()
{
    if (CALBC1_16MHZ==0xFF)             // 16MHz
    {
        while(1);                               // do not load, trap CPU!!
    }
    DCOCTL = 0;                               // Select lowest DCOx and MODx settings
    BCSCTL1 = CALBC1_16MHZ;                    // Set DCO
    DCOCTL = CALDCO_16MHZ;               // 16MHz
}

void initGPIO()
{
    P1SEL  |= RXD + TXD;
    P1SEL2 |= RXD + TXD;          //Assign pins 1.1 RX and 1.2 TX

    P1SEL |= BIT6 + BIT7;         // Assign I2C pins to USCI_B0
    P1SEL2|= BIT6 + BIT7;        // Assign I2C pins to USCI_B0
}

void initI2C()
{
    UCB0CTL1 |= UCSWRST;                      // Enable SW reset
    UCB0CTL0 = UCMST + UCMODE_3 + UCSYNC;     // I2C Master, synchronous mode
    UCB0CTL1 = UCSSEL_2 + UCSWRST;            // Use SMCLK, keep SW reset
    UCB0BR0 = 160;                            // fSCL = SMCLK/160 = ~100kHz
    UCB0BR1 = 0;
    UCB0I2CSA = AD5248_ADDR;                   // Slave Address
    UCB0CTL1 &= ~UCSWRST;                     // Clear SW reset, resume operation
    UCB0I2CIE |= UCNACKIE;
}

void uartInit()
{
    /*** UART Set-Up ***/
       UCA0CTL1 |= UCSSEL_2;         // SMCLK
       UCA0BR0 = 138;    // ~115200 baud
       UCA0BR1 = 0;

       UCA0MCTL = UCBRS2 + UCBRS0;        // Modulation UCBRSx = 5
       UCA0CTL1 &= ~UCSWRST;              // **Initialize USCI state machine**
       UC0IE |= UCA0TXIE;                 // Enable USCI_A0 TX interrupt
       IE2=UCA0TXIE;            // Enable USCI_A0 RX interrupt
       IE2=UCA0RXIE;            // Enable USCI_A0 RX interrupt
}

void putc(unsigned char c)
{
  while (!(IFG2 & UCA0TXIFG));
  UCA0TXBUF = c;
}

void bin2bcd(unsigned int v)
{
 unsigned int var;

 for (var = 0; var < 6; var++)
     { d[var] = v % 10;
     v=v/10; }
}

void delay_ms(unsigned int ms)
{
    while (ms)
    {
        __delay_cycles(16000);
        ms--;
    }
}

void delay(unsigned long d)
{
  unsigned long delay;
  for (delay = 0; delay < d; delay++);
}


//******************************************************************************
// Main ************************************************************************
// *****************************************************************************
//******************************************************************************

int main(void) {

     WDTCTL = WDTPW | WDTHOLD;     // Stop watchdog timer

    initClockTo16MHz();
    initGPIO();
    uartInit();                  // Initialize UART
    initI2C();

// USE Pin 2.0 for turning Voltage output ON/OFF
    P2SEL &= (~BIT0);  // Set P2.0 SEL for GPIO
    P2SEL2 &= (~BIT0); // Set P2.0 SEL for GPIO
    P2DIR |= BIT0;    // Set P2.0 as Output
    P2OUT &= (~BIT0); // Set P2.0 LOW

//Use Pin 2.1 for Trigger start
     P2IFG &= ~BIT1;    // P2.1 IFG cleared
     P2SEL &= (~BIT1);   // Set P2.1 SEL for GPIO
     P2SEL2 &= (~BIT1);  // Set P2.1 SEL for GPIO
     P2DIR &= (~BIT1);   // Set P2.1 as Input

     P2REN |= BIT1;      // Enable internal pull-up/down resistors
     P2OUT &= (~BIT1);   // Set as  pull down resistor

     P2IES &= ~BIT1;    // P2.1 LO/HI edge
     P2IFG &= ~BIT1;    // P2.1 IFG cleared
   //P2IE |= BIT1;     // P2.1 interrupt enabled
     P2IE &= (~BIT1);   // P2.1 interrupt disabled

