petersdw1/Battlab-One/MSP430.Firmware_Production_Rev_1.01.c
 // USE Pin 2.2 for turning ON/OFF sleep current Sense Resistor
     P2SEL &= (~BIT2);  // Set P2.2 SEL for GPIO
     P2SEL2 &= (~BIT2); // Set P2.2 SEL for GPIO
     P2DIR |= BIT2;    // Set P2.2 as Output
     P2OUT |= BIT2; // Set P2.2 LOW - Turn Low Current Sense Resistor Off

    delay_ms(100); //Delay waiting so secondary side of power rail can power up

    I2C_Master_WriteReg(INA233_ADDR, 0xD0, INA233_4_D0, 0x02);
    I2C_Master_WriteReg(INA233_ADDR, 0xD4, INA_D4, 0x02);

  //  _BIS_SR(CPUOFF + GIE);        // Enter LPM0 w/ interrupt
    __enable_interrupt();

     while(1){

         while(TXMode == TRANSMIT){
                         I2C_Master_WriteReg(INA233_ADDR, 0xD1, Reg_Data, 0x01); //write the desired command that is to return the value
                         I2C_Master_ReadReg(INA233_ADDR, 0xD1, 2);
                        // I2C_Master_WriteReg(INA233_ADDR, 0x89, Reg_Data, 0x01); //write the desired command that is to return the value
                        // I2C_Master_ReadReg(INA233_ADDR, 0x89, 2);
                         CopyArray(ReceiveBuffer, data, 2);

                         while(!(IFG2 & UCA0TXIFG));
                         UCA0TXBUF = (char) data[1];      // 0xD1 INA233 Vshunt register MSB
                         while(!(IFG2 & UCA0TXIFG));      // 0xD1 INA233 Vshunt register LSB
                         UCA0TXBUF = (char) data[0];
                         }
    }

}


//******************************************************************************
// I2C Interrupt For Received and Transmitted Data ALSO FOR UART TX******************************
//******************************************************************************

#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector = USCIAB0TX_VECTOR
__interrupt void USCIAB0TX_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(USCIAB0TX_VECTOR))) USCIAB0TX_ISR (void)
#else
#error Compiler not supported!
#endif
{
  if (IFG2 & UCB0RXIFG)                 // Receive I2C Data Interrupt
  {
      //Must read from UCB0RXBUF
      uint8_t rx_val = UCB0RXBUF;

      if (RXByteCtr)
      {
          ReceiveBuffer[ReceiveIndex++] = rx_val;
          RXByteCtr--;
      }

      if (RXByteCtr == 1)
      {
          UCB0CTL1 |= UCTXSTP;
      }
      else if (RXByteCtr == 0)
      {
          IE2 &= ~UCB0RXIE;
          MasterMode = IDLE_MODE;
          __bic_SR_register_on_exit(CPUOFF);      // Exit LPM0
      }
  }
  else if (IFG2 & UCB0TXIFG)            // Transmit I2C Data Interrupt
  {
      switch (MasterMode)
      {
          case TX_REG_ADDRESS_MODE:
              UCB0TXBUF = TransmitRegAddr;
              if (RXByteCtr)
                  MasterMode = SWITCH_TO_RX_MODE;   // Need to start receiving now
              else
                  MasterMode = TX_DATA_MODE;
                    // Continue to transmision with the data in Transmit Buffer
              break;

          case SWITCH_TO_RX_MODE:
              IE2 |= UCB0RXIE;              // Enable RX interrupt
              IE2 &= ~UCB0TXIE;             // Disable TX interrupt
              UCB0CTL1 &= ~UCTR;            // Switch to receiver
              MasterMode = RX_DATA_MODE;    // State state is to receive data
              UCB0CTL1 |= UCTXSTT;          // Send repeated start
              if (RXByteCtr == 1)
              {
                  //Must send stop since this is the N-1 byte
                  while((UCB0CTL1 & UCTXSTT));
                  UCB0CTL1 |= UCTXSTP;      // Send stop condition
              }
              break;

          case TX_DATA_MODE:
              if (TXByteCtr)
              {
                  UCB0TXBUF = TransmitBuffer[TransmitIndex++];
                  TXByteCtr--;
              }
              else
              {
                  //Done with transmission
                  UCB0CTL1 |= UCTXSTP;     // Send stop condition
                  MasterMode = IDLE_MODE;
                  IE2 &= ~UCB0TXIE;                       // disable TX interrupt
                  __bic_SR_register_on_exit(CPUOFF);      // Exit LPM0
              }
              break;

          default:
              __no_operation();
              break;
      }

  }

      else if (IFG2 & UCA0TXIFG)            // Transmit UART Data Interrupt
      {

      }
}

//******************************************************************************
// I2C Interrupt For Start, Restart, Nack, Stop ********************************
//******************************************************************************

#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector = USCIAB0RX_VECTOR
__interrupt void USCIAB0RX_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(USCIAB0RX_VECTOR))) USCIAB0RX_ISR (void)
#else
#error Compiler not supported!
#endif
{

    if (IFG2 & UCA0RXIFG)               // Receive UART Data Interrupt
    {
    unsigned char inp;
       inp = UCA0RXBUF;
       int i = 0;

       switch(inp)
       {
           case 'a': //Set Output to 1.2V
                I2C_Master_WriteReg(AD5248_ADDR, R2_ADDR,SetR2 , 0x01);
                I2C_Master_WriteReg(AD5248_ADDR, R1_ADDR, SetR1_1_2, 0x01);
           break;

           case 'b':  // Set Output to 1.5V
                I2C_Master_WriteReg(AD5248_ADDR, R2_ADDR,SetR2, 0x01);
                I2C_Master_WriteReg(AD5248_ADDR, R1_ADDR, SetR1_1_5, 0x01);
           break;

           case 'c': //Set Output to 2.4V
                I2C_Master_WriteReg(AD5248_ADDR, R2_ADDR,SetR2 , 0x01);
                I2C_Master_WriteReg(AD5248_ADDR, R1_ADDR, SetR1_2_4, 0x01);
           break;

           case 'd':  // Set Output to 3.0V
                I2C_Master_WriteReg(AD5248_ADDR, R2_ADDR,SetR2, 0x01);
                I2C_Master_WriteReg(AD5248_ADDR, R1_ADDR, SetR1_3_0, 0x01);
           break;

