petersdw1/Battlab-One/MSP430.Firmware_Production_Rev_1.01.c
           case 'o':  // Set Output to 3.2V
                I2C_Master_WriteReg(AD5248_ADDR, R2_ADDR,SetR2, 0x01);
                I2C_Master_WriteReg(AD5248_ADDR, R1_ADDR, SetR1_3_2, 0x01);
           break;

           case 'n':  // Set Output to 3.6V
                I2C_Master_WriteReg(AD5248_ADDR, R2_ADDR,SetR2, 0x01);
                I2C_Master_WriteReg(AD5248_ADDR, R1_ADDR, SetR1_3_6, 0x01);
           break;

           case 'e': //Set Output to 3.7V
                I2C_Master_WriteReg(AD5248_ADDR, R2_ADDR,SetR2 , 0x01);
                I2C_Master_WriteReg(AD5248_ADDR, R1_ADDR, SetR1_3_7, 0x01);
           break;

           case 'f':  // Set Output to 4.2V
                I2C_Master_WriteReg(AD5248_ADDR, R2_ADDR,SetR2, 0x01);
                I2C_Master_WriteReg(AD5248_ADDR, R1_ADDR, SetR1_4_2, 0x01);
           break;

           case 'g':  // Set Output to 4.5V
                I2C_Master_WriteReg(AD5248_ADDR, R2_ADDR,SetR2, 0x01);
                I2C_Master_WriteReg(AD5248_ADDR, R1_ADDR, SetR1_4_5, 0x01);
           break;

           case 'h':
               P2OUT |= BIT0; // Set P2.0 HIGH Turn PSU ON
           break;

           case 'i':
               P2OUT &= (~BIT0);   // Set P2.0 LOW Turn PSU OFF
           break;

           case 'j': //Get Sense Resistor calibration values

               while(!(IFG2 & UCA0TXIFG));
               UCA0TXBUF = (char) CAL_12_MSB;      // 0xD1 INA233 Vshunt register MSB
               while(!(IFG2 & UCA0TXIFG));      // 0xD1 INA233 Vshunt register LSB
               UCA0TXBUF = (char) CAL_12_LSB;

               while(!(IFG2 & UCA0TXIFG));
               UCA0TXBUF = (char) CAL_15_MSB;      // 0xD1 INA233 Vshunt register MSB
               while(!(IFG2 & UCA0TXIFG));      // 0xD1 INA233 Vshunt register LSB
               UCA0TXBUF = (char) CAL_15_LSB;

               while(!(IFG2 & UCA0TXIFG));
               UCA0TXBUF = (char) CAL_24_MSB;      // 0xD1 INA233 Vshunt register MSB
               while(!(IFG2 & UCA0TXIFG));      // 0xD1 INA233 Vshunt register LSB
               UCA0TXBUF = (char) CAL_24_LSB;

               while(!(IFG2 & UCA0TXIFG));
               UCA0TXBUF = (char) CAL_30_MSB;      // 0xD1 INA233 Vshunt register MSB
               while(!(IFG2 & UCA0TXIFG));      // 0xD1 INA233 Vshunt register LSB
               UCA0TXBUF = (char) CAL_30_LSB;

               while(!(IFG2 & UCA0TXIFG));
               UCA0TXBUF = (char) CAL_36_MSB;      // 0xD1 INA233 Vshunt register MSB
               while(!(IFG2 & UCA0TXIFG));      // 0xD1 INA233 Vshunt register LSB
               UCA0TXBUF = (char) CAL_36_LSB;

               while(!(IFG2 & UCA0TXIFG));
               UCA0TXBUF = (char) CAL_37_MSB;      // 0xD1 INA233 Vshunt register MSB
               while(!(IFG2 & UCA0TXIFG));      // 0xD1 INA233 Vshunt register LSB
               UCA0TXBUF = (char) CAL_37_LSB;

               while(!(IFG2 & UCA0TXIFG));
               UCA0TXBUF = (char) CAL_42_MSB;      // 0xD1 INA233 Vshunt register MSB
               while(!(IFG2 & UCA0TXIFG));      // 0xD1 INA233 Vshunt register LSB
               UCA0TXBUF = (char) CAL_42_LSB;

               while(!(IFG2 & UCA0TXIFG));
               UCA0TXBUF = (char) CAL_45_MSB;      // 0xD1 INA233 Vshunt register MSB
               while(!(IFG2 & UCA0TXIFG));      // 0xD1 INA233 Vshunt register LSB
               UCA0TXBUF = (char) CAL_45_LSB;

               ///Send Low Current calibration factors

               while(!(IFG2 & UCA0TXIFG));
               UCA0TXBUF = (char) OFFSET_12_MSB;      // 0xD1 INA233 Vshunt register MSB
               while(!(IFG2 & UCA0TXIFG));      // 0xD1 INA233 Vshunt register LSB
               UCA0TXBUF = (char) OFFSET_12_LSB;

               while(!(IFG2 & UCA0TXIFG));
               UCA0TXBUF = (char) OFFSET_15_MSB;      // 0xD1 INA233 Vshunt register MSB
               while(!(IFG2 & UCA0TXIFG));      // 0xD1 INA233 Vshunt register LSB
               UCA0TXBUF = (char) OFFSET_15_LSB;

               while(!(IFG2 & UCA0TXIFG));
               UCA0TXBUF = (char) OFFSET_24_MSB;      // 0xD1 INA233 Vshunt register MSB
               while(!(IFG2 & UCA0TXIFG));      // 0xD1 INA233 Vshunt register LSB
               UCA0TXBUF = (char) OFFSET_24_LSB;

               while(!(IFG2 & UCA0TXIFG));
               UCA0TXBUF = (char) OFFSET_30_MSB;      // 0xD1 INA233 Vshunt register MSB
               while(!(IFG2 & UCA0TXIFG));      // 0xD1 INA233 Vshunt register LSB
               UCA0TXBUF = (char) OFFSET_30_LSB;

               while(!(IFG2 & UCA0TXIFG));
               UCA0TXBUF = (char) OFFSET_32_MSB;      // 0xD1 INA233 Vshunt register MSB
               while(!(IFG2 & UCA0TXIFG));      // 0xD1 INA233 Vshunt register LSB
               UCA0TXBUF = (char) OFFSET_32_LSB;

               while(!(IFG2 & UCA0TXIFG));
               UCA0TXBUF = (char) OFFSET_36_MSB;      // 0xD1 INA233 Vshunt register MSB
               while(!(IFG2 & UCA0TXIFG));      // 0xD1 INA233 Vshunt register LSB
               UCA0TXBUF = (char) OFFSET_36_LSB;

               while(!(IFG2 & UCA0TXIFG));
               UCA0TXBUF = (char) OFFSET_37_MSB;      // 0xD1 INA233 Vshunt register MSB
               while(!(IFG2 & UCA0TXIFG));      // 0xD1 INA233 Vshunt register LSB
               UCA0TXBUF = (char) OFFSET_37_LSB;

               while(!(IFG2 & UCA0TXIFG));
               UCA0TXBUF = (char) OFFSET_42_MSB;      // 0xD1 INA233 Vshunt register MSB
               while(!(IFG2 & UCA0TXIFG));      // 0xD1 INA233 Vshunt register LSB
               UCA0TXBUF = (char) OFFSET_42_LSB;

               while(!(IFG2 & UCA0TXIFG));
               UCA0TXBUF = (char) OFFSET_45_MSB;      // 0xD1 INA233 Vshunt register MSB
               while(!(IFG2 & UCA0TXIFG));      // 0xD1 INA233 Vshunt register LSB
               UCA0TXBUF = (char) OFFSET_45_LSB;

           break;

           case 'k':
               P2OUT |= BIT2; // Set P2.2 HIGH to turn ON the sleep current Sense Resistor
               I2C_Master_WriteReg(INA233_ADDR, 0xD4, INA1_D4, 0x02);
           break;

           case 'l':
               P2OUT &= (~BIT2);   // Set P2.2 LOW to turn OFF the sleep current Sense Resistor
               I2C_Master_WriteReg(INA233_ADDR, 0xD4, INA_D4, 0x02);

           break;

           case 'm': //Get CONFIG
               I2C_Master_WriteReg(INA233_ADDR, 0xD4, Reg_Data, 0x01); //write the desired command that is to return the value
               I2C_Master_ReadReg(INA233_ADDR, 0xD4, 2);
               CopyArray(ReceiveBuffer, data, 2);

               while(!(IFG2 & UCA0TXIFG));
               UCA0TXBUF = (char) data[1];      // 0xD4 INA233 register MSB
               while(!(IFG2 & UCA0TXIFG));      // 0xD4 INA233 register LSB
               UCA0TXBUF = (char) data[0];

               I2C_Master_WriteReg(INA233_ADDR, 0xD0, Reg_Data, 0x01); //write the desired command that is to return the value
               I2C_Master_ReadReg(INA233_ADDR, 0xD0, 2);
               CopyArray(ReceiveBuffer, data, 2);

               while(!(IFG2 & UCA0TXIFG));
               UCA0TXBUF = (char) data[1];      // Send the 0xD0 INA233 register MSB
               while(!(IFG2 & UCA0TXIFG));      // 0xD0 INA233  register LSB
               UCA0TXBUF = (char) data[0];

           break;

           case 't': //Set number of averages to 16
               I2C_Master_WriteReg(INA233_ADDR, 0xD0,INA233_4_D0, 0x02);
           break;

           case 'u': //Set number of averages to 16
               I2C_Master_WriteReg(INA233_ADDR, 0xD0,INA233_16_D0, 0x02);
           break;

           case 'v': //Set number of averages to 16
               I2C_Master_WriteReg(INA233_ADDR, 0xD0,INA233_64_D0, 0x02);
           break;

           case 'p': //Send firmware version number
               while(!(IFG2 & UCA0TXIFG));
               UCA0TXBUF = (char) VERSION_MSB;  // 0xD1 INA233 Vshunt register MSB
               while(!(IFG2 & UCA0TXIFG));      // 0xD1 INA233 Vshunt register LSB
               UCA0TXBUF = (char) VERSION_LSB;
           break;

           case 'x':

               P2IE |= BIT1;       // P2.1 interrupt enabled/set trigger
               P2IES &= ~BIT1;    // P2.1 LO/HI edge triggering
           break;

           case 'y':
               P2IE &= (~BIT1);   // P2.1 interrupt disabled/stop transmitting
                TXMode=IDLE;
           break;

           case 'z':
               P2IE &= (~BIT1);   // P2.1 interrupt disabled/start transmitting
               TXMode=TRANSMIT;
           break;

            }
        }

    else if (UCB0STAT & UCNACKIFG)             // Receive I2C Data Interrupt
    {
        UCB0STAT &= ~UCNACKIFG;                     // Clear NACK Flags
    }
    if (UCB0STAT & UCSTPIFG)                        //Stop or NACK Interrupt
    {
        UCB0STAT &=
            ~(UCSTTIFG + UCSTPIFG + UCNACKIFG);     //Clear START/STOP/NACK Flags
    }
    else if (UCB0STAT & UCSTTIFG)
    {
        UCB0STAT &= ~(UCSTTIFG);                    //Clear START Flags
    }
}

// Port 2 Trigger Interrupt Service Routine
#pragma vector=PORT2_VECTOR
__interrupt void Port_2(void)
{
  int cntr;

  for (cntr=0;cntr<100;cntr++){

      if (cntr=99){

       if (TXMode == IDLE) {

           TXMode = TRANSMIT;  // Start capture mode
       }

       else {
       while(!(IFG2 & UCA0TXIFG));
       UCA0TXBUF = 0xFF;             // 0xD1 INA233 Vshunt register MSB
       while(!(IFG2 & UCA0TXIFG));   // 0xD1 INA233 Vshunt register LSB
       UCA0TXBUF = 0xFF;
       while(!(IFG2 & UCA0TXIFG));
       UCA0TXBUF = 0x00;             // 0xD1 INA233 Vshunt register MSB
       while(!(IFG2 & UCA0TXIFG));   // 0xD1 INA233 Vshunt register LSB
       UCA0TXBUF = 0x00;
       delay(10000);
       TXMode = IDLE;     // Stop capture mode
       }

      }
  }
   P2IES |=  BIT1;        // P2.1 HI/LO edge
   P2IFG &= ~BIT1;        // P2.1 IFG cleared
}
